run/solidMelting2D/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    left
    {
        type            fixedFluxPressure;
    }

    right
    {
        type            totalPressure;
        p0              $internalField;
        value           $internalField;
    }

    bottom
    {
        type            fixedFluxPressure;
    }

    top
    {
        type            fixedFluxPressure;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
