run/solidMelting2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       25770;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       25870;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          130;
        startFace       25970;
    }
    top
    {
        type            patch;
        nFaces          130;
        startFace       26100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          26000;
        startFace       26230;
    }
)

// ************************************************************************* //
